
import React from 'react';
import {
    StyleSheet,
    Text,
    View,

    ScrollView, FlatList, Image, TouchableOpacity, TextInput,StatusBar
} from 'react-native';
import Header from '../../../../SharedModule/Header/Header';
import { Card } from 'react-native-paper';
import Icon from 'react-native-vector-icons/FontAwesome';
import { SafeAreaView } from 'react-navigation';
import {stylesPetition} from './styleForms';

export default class Petition extends React.Component {

    constructor() {
        super();

        this.state = {


           data: [
                {
                    id: 1,


                    title: 'دادخواست عزل ولی قهری و نصب قیم'

                }
                ,
                {
                    id: 2,
                    title: 'دادخواست عزل قیم'



                }
                , {
                    id: 3,
                    title: 'دادخواست عزل وصی از وضایف'



                }

                , {
                    id: 4,
                    title: 'دادخواست تامین دلیل با جلب نظر کارشناس  درمورد تغییر شغل محل کسب'



                }
                , {
                    id: 5,
                    title: 'دادخواست تامین دلیل تعدی و تفریط'


                }
                , {
                    id: 6,
                    title: 'دادخواست تامین دلیل تبدیل مورد اجاره به محل فساد'


                }
                ,{
                    id: 7,


                    title: 'دادخواست تامین دلیل در عدم تکمیل تعمیرات'

                }
                ,
                {
                    id: 8,
                    title: 'دادخواست تامین دلیل در خرید مال غیرمنقول'



                }
                , {
                    id: 9,
                    title: 'دادخواست تامین دلیل خسارات وارده به منزل'



                }

                , {
                    id: 10,
                    title: 'دادخواست تامین دلیل تغییر در آپارتمان و نماآت'



                }
                , {
                    id: 11,
                    title: 'دادخواست تامین دلیل ایجاد تغییرات در نماآت'


                }
                , {
                    id: 12,
                    title: 'دادخواست تامین دلیل در خرید اتومبیل'


                }
                ,{
                    id: 13,


                    title: 'دادخواست تامین دلیل خسارت وارده به اتومبیل'

                }
                ,
                {
                    id: 14,
                    title: 'دادخواست تامین خواسته'



                }
                , {
                    id: 15,
                    title: 'نمونه دادخواست ابطال چک مفقود شده'



                }

                , {
                    id: 16,
                    title: 'نمونه دادخواست اعلام حضور خریدار در دفترخانه'



                }
                , {
                    id: 17,
                    title: 'نمونه دادخواست اعلام حضور فروشنده در دفترخانه'


                }
                , {
                    id: 18,
                    title: 'نمونه پاسخ اداره ثبت به دادگاه در خصوص حضور در خصوص بازداشت  پلاک ثبتی'


                }
                , {
                    id: 19,
                    title: 'نمونه آگهی تاسیس شرکت (سهامی خاص)'


                }
                , {
                    id: 20,
                    title: 'نمونه استشهادیه در خصوص حضور در دفترخانه'


                }
                , {
                    id: 21,
                    title: 'مدارک لازم برای صدور اجرایه چک بلامحل'


                }
                , {
                    id: 22,
                    title: 'گواهی سر دفتران اسناد رسمی در قبال قولنامه های عادی'


                }
                , {
                    id: 23,
                    title: 'گواهی سردفتران برای ذی نفع در زمینه علت عدم انجام معامله'


                }
                , {
                    id: 24,
                    title: 'گواهی دفترخانه مبنی بر اعلام حضور مالک'


                }
                , {
                    id: 25,
                    title: 'گواهی دفترخانه مبنی بر اعلام حضور خریدار'


                }
                , {
                    id: 26,
                    title: 'درخواست وصول مهریه (اجراییه ثبت اسناد)'


                }
                , {
                    id: 27,
                    title: 'درخواست منع خروج بدهکار از کشور باتوجه به پرونده اجرایی از اداره گذرنامه'


                }
                , {
                    id: 28,
                    title: 'درخواست از سردفتر جهت ثبت حضور در دفترخانه'


                }
                , {
                    id: 29,
                    title: 'تقاضای نصب مجدد سرب پلمپ سند مالکیت'


                }
                , {
                    id: 30,
                    title: 'تقاضای ممنوع الخروجی از طریق اجرای سند مالکیت'


                }
                , {
                    id: 31,
                    title: 'تقاضای مطالبه اجوراز طریق دفترخانه'


                }
                , {
                    id: 32,
                    title: 'تقاضای کسر حقوق بدهکار از طریق اجرای اسناد رسمی'


                }
                , {
                    id: 33,
                    title: 'تقاضای صدور سند مالکیت'


                }
                , {
                    id: 34,
                    title: 'تقاضای صدور سند مالکیت جدید برای وراث'


                }
                , {
                    id: 35,
                    title: 'تقاضای صدور سند مالکیت براساس تنظیم تقسیم نامه'


                }
                , {
                    id: 36,
                    title: 'تقاضای صدور سند مالکیت المثنی به لحاظ مفقودی'


                }
                , {
                    id: 37,
                    title: 'تقاضای صدور سند تجمیعی'


                }
                , {
                    id: 38,
                    title: 'تقاضای صدور اجراییه و تعقیب عملیات اجرایی  در خصوص چک بلامحل'


                }
                , {
                    id: 39,
                    title: 'تقاضای صدور اجراییه جهت وصول اجور و تخلیه از طریق دفترخانه'


                }
                , {
                    id: 40,
                    title: 'تقاضای سند مالکیت متمم الصاقی'


                }
                , {
                    id: 41,
                    title: 'تقاضای ثبت ملک'


                }
                , {
                    id: 42,
                    title: 'تقاضای تعویض سند غیرقابل استفاده (سوخته-فرسوده-آب ریختگی)'


                }
                , {
                    id: 43,
                    title: 'تقاضای تبدیل اسناد مالکیت مشاعی به یک جلد'


                }
                , {
                    id: 44,
                    title: 'تقاضای بازداشت وجه نزد ششخص ثالث (موجر و ...)'


                }
                , {
                    id: 45,
                    title: 'تقاضای بازداشت تلفن مدیون از سوی طلبکار'


                }
                , {
                    id: 46,
                    title: 'تقاضای بازداشت تلفن مدیون از طریق اجرای اسناد رسمی'


                }
                , {
                    id: 47,
                    title: 'تقاضای بازداشت پلاک ثبتی مدیون از سوی طلبکار'


                }
                , {
                    id: 48,
                    title: 'تقاضای بازداشت اموال (اثاثیه منزل یا مغازه یاکارگاه و...) از طریق اجرای اسناد رسمی'


                }
                , {
                    id: 49,
                    title: 'تقاضای آگهی تحدید حدود اختصاصی'


                }
                , {
                    id: 50,
                    title: 'تقاضای افراز املاک مشاع'


                }
                , {
                    id: 51,
                    title: 'تقاضای اصلاح حدود طبق ماده 149 قانون ثبت'


                }
                , {
                    id: 52,
                    title: 'تقاضای اصلاح حد به کوچه'


                }
                , {
                    id: 53,
                    title: 'تقاضای اخذ نقشه ثبتی'


                }
                , {
                    id: 54,
                    title: 'تقاضای اجرای ماده 45 آیین نامه قانون ثبت'


                }
                , {
                    id: 55,
                    title: 'استعلام از اداره ثبت اسناد و املاک در خصوص وضعیت ثبتی پلاک'


                }
                , {
                    id: 56,
                    title: 'ارسال رونوشت قرار تامین خواسته به اداره ثبت'


                }
                , {
                    id: 57,
                    title: 'استرداد جهزیه مقوم به ریال به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 58,
                    title: 'ملاقات فرزند به لنضمامکلیه خسارات قانونی'


                }
                , {
                    id: 59,
                    title: 'مطالبه خسارت بر هم زدن نامزدی به میزان ریال به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 60,
                    title: 'تقاضای صدور حکم فرزند خواندگی'


                }
                , {
                    id: 61,
                    title: 'تعیین تکلیف زندگی خانوادگی به انضمام کلیه خسارات قانونی با قرار تامین خواسته'


                }
                , {
                    id: 62,
                    title: 'استرداد جهزیه مقوم به انضمام کلیه خسارات قانونی با قرار تامین خواسته '


                }
                , {
                    id: 63,
                    title: 'تقاضای صدور حکم 1.ممنوعیت از اشتغال به تحصیل 2. تمکین به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 64,
                    title: 'تقاضای صدور حکم تمکین'


                }
                , {
                    id: 65,
                    title: 'مطالبه نفقه ایام زوجیت به میزان ریال به انضمام کلیه خسارات قانونی با صدور قرار تامین خواسته'


                }
                , {
                    id: 66,
                    title: 'الزام به تهیه مسکن (از نفقه) مقوم به ریال به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 67,
                    title: 'مطالبه نفقه ایام زوجیت به میزان ریال به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 68,
                    title: 'اعسار از پرداخت مهریه/نفقه'


                }
                , {
                    id: 69,
                    title: 'اعسار از پرداخت مهریه/تقسیط آن'


                }
                , {
                    id: 70,
                    title: 'مطالبه مهریه به میزان ریال به انضمام کلیه خسارات قانونی باصدور قرارتامین'


                }
                , {
                    id: 71,
                    title: 'صدور قرار تامین خواسته عادی مهریه'


                }
                , {
                    id: 72,
                    title: 'مطالبه مهریه به میزان ریال به انضمام کلیه خساراتد قانونی قرار تامین خواسته'


                }
                , {
                    id: 73,
                    title: 'رسیدگی صدور حکم ،مبنی بر الزام زوج به تادیه مهرالمسمی به میزان'


                }
                , {
                    id: 74,
                    title: 'مطالبه مهریه به میزان ریال به انضمام کلیه خسارات قانون'


                }
                , {
                    id: 75,
                    title: 'تنفیذ فسخ نکاح به علت فقدان وصف و استرداد هدایای تقدیمی مقوم به'


                }
                , {
                    id: 76,
                    title: 'تنفیذ فسخ نکاح به علت فقدان وصف به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 77,
                    title: 'صدور حکم تنفیذ فسخ نکاح به علت فقدان وصف به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 78,
                    title: 'صدور حکم تنفیذ فسخ نکاح به علت وجود عیب  به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 79,
                    title: 'بطلان ازدواج خواندگان به علت عدم کسب اجازه ولی به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 80,
                    title: 'ابطال عقد ازدواج به علت وجود اکراه و فقدان قصد به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 81,
                    title: 'ابطال عقد ازدواج به علت عدم رعایت غبطه و مصلحت'


                }
                , {
                    id: 82,
                    title: 'تنفیذ طلاق منعقذه در کشور....'


                }
                , {
                    id: 83,
                    title: 'صدور گواهی عدم امکان سازش به علت عدم پرداخت نفقه به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 84,
                    title: 'صدور گواهی عدم امکان سازش به علت تحقق شروط عقدنامه به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 85,
                    title: 'صدور گواهی عدم امکان سازش به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 86,
                    title: 'سلب حضانت و سرپرستی فرزند از ...'


                }
                , {
                    id: 87,
                    title: 'تحویل فرزند به اینجانب و صدور حکم حضانت طفل به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 88,
                    title: 'صدور حکم حضانت به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 89,
                    title: 'الزام به ثبت واقعه رجوع به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 90,
                    title: 'تجویز ازدواج مجدد به انضمام کلیه خسارات قانونی '


                }
                , {
                    id: 91,
                    title: 'اثبات رابطه زوجیت دائم/موقت به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 92,
                    title: 'تقاضای صدور حکم ثبت واقعه ازدواج موقت به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 93,
                    title: 'ثبت ازدواج دائم به انضمام کلیه خسارات قانونی'


                }
                , {
                    id: 94,
                    title: 'اجازه ثبت ازدواج به علت عدم امکان استئذان از ولی'


                }
                , {
                    id: 95,
                    title: 'اجازه ثبت ازدواج به علت خودداری ولی از اذن'


                }

            ],
        };
    }




    render() {
        return (
            <SafeAreaView style={{ flex: 1, backgroundColor: '#fff' }}>
                  <StatusBar hidden={false} translucent={true} networkActivityIndicatorVisible={true}
                   backgroundColor={'#333'}
                   barStyle="light-content" />
          <Header title="دادخواست ها" onBackPress={() => {
                    this.props.navigation.goBack();
                }}/>

                <View style={stylesPetition.formContent}>
                    <View style={stylesPetition.inputContainer}>
                        <Icon
                            name='search'
                            color='#067062'
                            size={20} style={{ marginLeft: 5 }} />
                        <TextInput style={stylesPetition.inputs}
                            ref={'txtSearch'}
                            placeholder="جستجو"
                            underlineColorAndroid='transparent'
                            onChangeText={(name_address) => this.setState({ name_address })} />
                    </View>

                 </View>

                <View style={{ flex: 1, marginTop: 2 }}>
                    <FlatList style={{marginTop:25}} enableEmptySections={true}
                        numColumns={1}
                        data={this.state.data}
                        keyExtractor={(item) => {
                            return item.id;
                        }}
                        renderItem={({ item }) => {
                            return (

                                <Card style={stylesPetition.cc} key={0}>
                                    <View style={{ flex: 1, flexDirection: 'row-reverse', }}>

                                        <View style={stylesPetition.v1}>
                                            <Text style={stylesPetition.t1}>{item.title}</Text>


                                        </View>

                                        <View style={stylesPetition.v2}>

                                            <TouchableOpacity onPress={() => this.props.navigation.navigate('det')}>
                                                <Icon
                                                    name="download"
                                                    color='#fff'
                                                    style={{ fontSize: 20,marginBottom:2 }}
                                                />
                                            </TouchableOpacity>

                                        </View>
                                    </View>

                                </Card>

                            )
                        }} />
                </View>

            </SafeAreaView>
        );
    }
}

// Judicialcalculations
